gastonfeng/bootloader_stm32/mFirmata.cpp
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
#ifdef FIRMATA_SERIAL_FEATURE
        case SERIAL_MESSAGE:
            serialFeature->handleSysex(fm, FirmataStream, command, argc, argv);
            break;
#endif
        case CB_GET_REMAIN_MEM:
            fm->sendSysex(FirmataStream, CB_GET_REMAIN_MEM, 2, (byte *) &plc_var.info.remain_mem);
            break;
        case CB_GET_RTE_VERSION:
            fm->sendSysex(FirmataStream, CB_GET_RTE_VERSION, sizeof(rte_ver_t), (uint8_t *) &plc_var.config.rte_ver);
            break;
        case CB_PLC_START:
            rte.app_start();
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_PLC_START);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case CB_PLC_STOP:
            rte.app_stop();
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_PLC_STOP);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case REPORT_PLC_MD5:
            if (plc_var.info.plc_curr_app)
                fm->sendSysex(FirmataStream, REPORT_PLC_MD5, 32, (byte *) plc_var.info.plc_curr_app->id);
            else
                fm->sendSysex(FirmataStream, REPORT_PLC_MD5, 0, (byte *) "");
            break;
        case CB_PLC_LOAD:
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_PLC_LOAD);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            rte.app_stop();
            app.unload();
            rte.load_app();
            break;
        case CB_PLC_REPAIR:
            rte.app_stop();
            app.unload();
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_PLC_REPAIR);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case FM_FLASH_CLEAR:
            len = 0;
            fm->sendSysex(FirmataStream, FM_FLASH_CLEAR, 4, (byte *) &len);
            board.flashClear();
            hwboard::reset();
            break;
#endif
#if defined(USE_RTC) || defined(USE_PCF8563)
        case CB_GET_RTC:
            fm->sendSysex(FirmataStream, CB_GET_RTC, sizeof(rtc_t), (byte *) &plc_var.info.rtc);
            break;
        case CB_SET_RTC:
            new_time.tm_year = *(u16 *) &argv[0];
            new_time.tm_mon = argv[2];
            new_time.tm_mday = argv[3];
            new_time.tm_hour = argv[4];
            new_time.tm_min = argv[5];
            new_time.tm_sec = argv[6];
            new_time.tm_wday = argv[7];
            rtc.set_time(&new_time);
            fm->sendSysex(FirmataStream, CB_SET_RTC, 0, nullptr);
            break;
#endif
#ifdef ARDUINO
#ifdef USE_LWIP
#ifdef USE_IP_MODIFY
            case CB_SET_IP:
                byte ip[4];
                decodeByteStream(argc, (const byte *) argv, ip);
                plc_var.config.ip.ip1 = ip[0];
                plc_var.config.ip.ip2 = ip[1];
                plc_var.config.ip.ip3 = ip[2];
                plc_var.config.ip.ip4 = ip[3];
                ETH_LWIP::set_ip();
                fm->sendSysex(FirmataStream, CB_SET_IP, 4, (byte *) (&plc_var.config.ip));
                break;
#endif
            case CB_GET_IP:
                fm->sendSysex(FirmataStream, CB_GET_IP, 4, (byte *) (&plc_var.config.ip));
                break;
            case FM_GET_NET_BUF_STAT:
                buffer = (char *) malloc(13 * MEMP_MAX);
                for (int i = 0; i < MEMP_MAX; i++) {
                    *(u8 *) &buffer[0 + 13 * i] = memp_pools[i]->stats->avail;
                    *(u8 *) &buffer[1 + 13 * i] = memp_pools[i]->stats->err;
                    *(u8 *) &buffer[2 + 13 * i] = memp_pools[i]->stats->illegal;
                    *(u8 *) &buffer[3 + 13 * i] = memp_pools[i]->stats->max;
                    *(u8 *) &buffer[4 + 13 * i] = memp_pools[i]->stats->used;
                    memcpy(&buffer[5 + 13 * i], memp_pools[i]->stats->name, 8);
                }
                fm->sendSysex(FirmataStream, FM_GET_NET_BUF_STAT, 13 * MEMP_MAX, (byte *) buffer);
                free(buffer);
                break;
#endif
#ifdef USE_FREERTOS
        case CB_THREAD_INFO:
            typedef struct {
                u32 xTaskNumber;           /* A number unique to the task. */
                uint32_t ulRunTimeCounter; /* The total run time allocated to the task so far, as defined by the run time stats clock.  See http://www.freertos.org/rtos-run-time-stats.html.  Only valid when configGENERATE_RUN_TIME_STATS is defined as 1 in FreeRTOSConfig.h. */
                u32 pxStackBase;           /* Points to the lowest address of the task's stack area. */
                uint16_t usStackHighWaterMark;
                char name[8];
                uint16_t eCurrentState;     /* The state in which the task existed when the structure was populated. */
                uint16_t uxCurrentPriority; /* The priority at which the task was running (maybe inherited) when the structure was populated. */
                uint16_t uxBasePriority;    /* The priority to which the task will return if the task's current priority has been inherited to avoid unbounded priority inversion when obtaining a mutex.  Only valid if configUSE_MUTEXES is defined as 1 in FreeRTOSConfig.h. */
            } task_info;
            u32 task_num;
            u32 TotalRunTime;
            TaskStatus_t *StatusArray;
            task_num = uxTaskGetNumberOfTasks();
            buffer = (char *) malloc(task_num * sizeof(task_info));
            StatusArray = (TaskStatus_t *) pvPortMalloc(task_num * sizeof(TaskStatus_t));
            if (StatusArray != nullptr) {

                uxTaskGetSystemState(StatusArray, (UBaseType_t) task_num, (uint32_t *) &TotalRunTime);
                for (int i = 0; i < task_num; i++) {
                    auto *d = (task_info *) &buffer[i * sizeof(task_info)];
                    auto *s = (TaskStatus_t *) &StatusArray[i];
                    if (s) {
                        strcpy(d->name, s->pcTaskName);
                        d->xTaskNumber = s->xTaskNumber;
                        d->eCurrentState = s->eCurrentState;
                        d->pxStackBase = (u32) s->pxStackBase;
                        d->ulRunTimeCounter = s->ulRunTimeCounter;
                        d->uxBasePriority = s->uxBasePriority;
                        d->usStackHighWaterMark = s->usStackHighWaterMark;
                        d->uxCurrentPriority = s->uxCurrentPriority;
                    }
                }
            }
            fm->sendSysex(FirmataStream, CB_THREAD_INFO, (task_num * sizeof(task_info)), (byte *) (buffer));
            vPortFree(StatusArray);
            free(buffer);
            break;
#endif
#endif
#if defined(RTE_APP) || defined(PLC)
        case CB_SET_FORCE:
            for (int i = 0; i < argc;) {
                const u16 *byte = (u16 *) &argv[i];
                len = argv[i + 2];
                index = *byte;
                if (plc_var.info.plc_state == (u8) PLC_STATUS::Started) {
                    plc_var.info.plc_curr_app->dbg_set_force(index, len ? &argv[i + 3] : nullptr);
                }
                i += len + 3;
            }
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_SET_FORCE);
            fm->write(FirmataStream, argc);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;

        case CB_CLEAR_V:
            if (plc_var.info.plc_curr_app && (plc_var.info.plc_state == (u8) PLC_STATUS::Started)) {
                plc_var.info.plc_curr_app->dbg_vars_reset(__IEC_DEBUG_FLAG);
                logger.debug("monitor var reset.");
            } else {
                logger.debug("monitor var not reset.plc_state=0x%x ", plc_var.info.plc_state);
            }
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_CLEAR_V);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case CB_SET_V:
            if (argc > 2) {
                byte *bufs;
                bufs = (byte *) malloc(argc);
                decodedLen = decodeByteStream(argc, argv, bufs);
                // logger.debug("set_v %d -> %d", argc, decodedLen);
                for (int i = 0; i < decodedLen; i += 2) {
                    const u16 *byte = (u16 *) &bufs[i];
                    indexv = *byte;
                    // logger.debug("%d %d", i, indexv);
                    if (plc_var.info.plc_curr_app) {
                        plc_var.info.plc_curr_app->dbg_var_register(indexv);
                    }
                }
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_SET_V);
                fm->write(FirmataStream, decodedLen);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                free(bufs);
            }
            break;
        case CB_GET_V:
            len = 0;
            data = (u8 *) malloc(512);
            if (plc_var.info.plc_state == (u8) PLC_STATUS::Started) {
                void *b = &data[4];
                plc_var.info.plc_curr_app->dbg_data_get((u32 *) &data[0], (u32 *) &len, (void **) &b);
                memcpy(&data[4], b, len);
                plc_var.info.plc_curr_app->dbg_data_free();
            }
            fm->sendSysex(FirmataStream, CB_GET_V, len + 4, data);
            free(data);
            break;
#endif
#ifdef ARDUINO
        case CB_SET_SERIAL_RX:

            // port = *(uint16_t *) argv;
            //            kSerial::get_serial(port)->set_rx();
            break;
        case CB_SET_SERIAL_TX_HIGH:

            // port1 = *(uint16_t *) argv;
            //            kSerial::get_serial(port1)->set_high();
            break;
        case CB_SET_SERIAL_TX_LOW:

