gastonfeng/bootloader_stm32/mFirmata.cpp
            // port2 = *(uint16_t *) argv;
            //            kSerial::get_serial(port2)->set_low();
            break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case FM_GET_TASK_NRS:
            fm->sendSysex(FirmataStream, FM_GET_TASK_NRS, 1, &(plc_var.info.plc_task_cnt));
            break;
        case FM_GET_TASK_NAME:
            if (tasks[argv[0]]) {
                fm->sendSysex(FirmataStream, FM_GET_TASK_NAME, (byte) strlen(tasks[argv[0]]->task_name),
                              (byte *) tasks[argv[0]]->task_name);
            }
            break;
        case FM_GET_TASK_DETAIL:
            if (tasks[argv[0]]) {
                fm->sendSysex(FirmataStream, FM_GET_TASK_DETAIL, 24, tasks[argv[0]]->mata());
            }
            break;
        case FM_GET_PLC_STATE:
            fm->sendSysex(FirmataStream, FM_GET_PLC_STATE, 1, (byte *) (&plc_var.info.plc_state));
            break;
        case FM_GET_PLC_INFO:
            if (plc_var.info.plc_curr_app) {
                info.build = plc_var.info.plc_curr_app->buildnumber;
                strcpy(info.name, plc_var.info.plc_curr_app->app_name);
                fm->sendSysex(FirmataStream, FM_GET_PLC_INFO, sizeof(info), (byte *) &info);
            } else
                fm->sendSysex(FirmataStream, FM_GET_PLC_INFO, 0, (byte *) &info);
            break;
        case CB_GET_LOG_NUMBER:
            fm->sendSysex(FirmataStream, CB_GET_LOG_NUMBER, 5, (byte *) (&plc_var.info.plc_state));
            break;
        case CB_GET_LOG:
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_GET_LOG);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
#ifdef USE_BOOTLOADER
        case CB_GET_BOOT_VERSION:
#ifdef BOOTINFO
            boot_t *b;
            b = (boot_t *) BOOTINFO; // platformio.ini中定义
            if (b)
                fm->sendSysex(FirmataStream, CB_GET_BOOT_VERSION, sizeof(boot_t), (byte *) b);
            else
#endif
            {
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_GET_BOOT_VERSION);
                fm->write(FirmataStream, 0);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
            }
            break;
        case FM_FLASH_BOOT:
            len = board.updateBootbin();
            fm->sendSysex(FirmataStream, FM_FLASH_BOOT, len, (byte *) &len);
            break;
#endif
#endif
#ifdef USE_KVDB
        case FM_LIST_KEY:
            kvdb.list(fm, FirmataStream);
            break;
        case CB_READ_KEY:
            size_t vlen;
            buffer = kvdb.get((const char *) argv);
            vlen = strlen(buffer);
            if (buffer && (vlen > 0))
                fm->sendSysex(FirmataStream, CB_READ_KEY, (byte) vlen, (byte *) buffer);
            else
                fm->sendSysex(FirmataStream, CB_READ_KEY, 0, (byte *) buffer);
            break;
        case FM_READ_KEY_BYTES:
            data = (u8 *) malloc(256);
            len = kvdb.get((const char *) argv, (char *) data + 4, 256, (u32 *) data);
            fm->sendSysex(FirmataStream, FM_READ_KEY_BYTES, len + 4, (byte *) data);
            free(data);
            break;
        case CB_WRITE_KEY:
            size_t key_len;
            key_len = strlen((const char *) argv);
            int rw;
            rw = kvdb.set((const char *) argv, (const char *) argv + key_len + 1, (int) (argc - key_len - 2));
            fm->sendSysex(FirmataStream, CB_WRITE_KEY, 4, (byte *) &rw);
            break;
        case FM_WRITE_KEY_BYTES:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            uint32_t type;
            type = *(uint32_t *) (decodeBuf + key_len + 1);
            len = kvdb.set((const char *) decodeBuf, (const char *) (decodeBuf + key_len + 1 + 4),
                           (int) (decodedLen - key_len - 1 - 4), type);
            fm->sendSysex(FirmataStream, FM_WRITE_KEY_BYTES, 4, (byte *) &len);
            break;
        case CB_RM_KEY:
            kvdb.remove((const char *) argv);
            fm->sendSysex(FirmataStream, CB_RM_KEY, 0, argv);
            break;
        case CB_SET_TSL_RANGE:
            tsl_query q;
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            if (decodedLen == key_len + 13) {
                start = *(u32 *) &decodeBuf[key_len + 1];
                end = *(u32 *) &decodeBuf[key_len + 1 + 4];
                state = (int) *(u32 *) &decodeBuf[key_len + 1 + 8];
                memset(&q, 0, sizeof(q));
                tsdb.query((const char *) decodeBuf, start, end, (fdb_tsl_status) (state), &q);
            }
            fm->sendSysex(FirmataStream, CB_SET_TSL_RANGE, sizeof(tsl_query), (byte *) &q);
            break;
        case CB_SET_TSL_STATUS:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            len = -1;
            if (decodedLen == key_len + 13) {
                start = *(u32 *) &decodeBuf[key_len + 1];
                end = *(u32 *) &decodeBuf[key_len + 1 + 4];
                state = (int) *(u32 *) &decodeBuf[key_len + 1 + 8];
                len = tsdb.set_status((const char *) decodeBuf, start, end, (fdb_tsl_status) (state));
            }
            fm->sendSysex(FirmataStream, CB_SET_TSL_STATUS, 4, (byte *) &len);
            break;
        case CB_GET_TSL:
            char *tbuf;
            int tlen;
            tbuf = (char *) malloc(256);
            memset(tbuf, 0, 256);
            tlen = tsdb.query_read((const char *) argv, (u32 *) &tbuf[0], (fdb_time_t *) &tbuf[4],
                                   (int *) (tbuf + 8),
                                   tbuf + 12, 256 - 12);
            if (tlen < 0)
                tlen = 0;
            else {
                *(u32 *) &tbuf[tlen] = GenerateCRC32Sum((const u8 *) tbuf, tlen, 0);
                tlen += 4;
            }
            fm->sendSysex(FirmataStream, CB_GET_TSL, (byte) tlen, (byte *) tbuf);
            free(tbuf);
            break;
        case CB_GET_TSL_BY_ID:
            decodedLen = decodeByteStream(argc, argv, decodeBuf);
            key_len = strlen((const char *) decodeBuf);
            if (decodedLen != key_len + 5)return;
            tbuf = (char *) malloc(256);
            memset(tbuf, 0, 256);
            tlen = tsdb.query_read_by_id((const char *) argv, *(u32 *) decodeBuf[key_len + 1], (u32 *) &tbuf[0],
                                         (fdb_time_t *) &tbuf[4],
                                         (int *) (tbuf + 8),
                                         tbuf + 12, 256 - 12);
            if (tlen < 0)
                tlen = 0;
            else {
                *(u32 *) &tbuf[tlen] = GenerateCRC32Sum((const u8 *) tbuf, tlen, 0);
                tlen += 4;
            }
            fm->sendSysex(FirmataStream, CB_GET_TSL_BY_ID, (byte) tlen, (byte *) tbuf);
            free(tbuf);
            break;
        case CB_TSL_CLEAR:
            key_len = strlen((const char *) argv);
            // index = *(int *) &argv[key_len + 1];

            fm->sendSysex(FirmataStream, CB_TSL_CLEAR, (byte) sizeof(state), (byte *) &state);
            state = TSL::clear((const char *) (argv));
            break;
#endif
#ifdef USE_SOEM
            case FM_SOEM_SCAN:
                soem_scan(fm, FirmataStream);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
        case CB_SET_PLC_FILE:
            app.setPLCDLL((char *) argv);
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, CB_SET_PLC_FILE);
            fm->write(FirmataStream, 0);
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case CB_CPU_USAGE:
            fm->sendSysex(FirmataStream, CB_CPU_USAGE, 1, (byte *) &plc_var.info.cpu_usage);
            break;
#endif
#ifdef USE_WIFI
            case CB_WIFI_LIST:
                fm->sendSysex(FirmataStream, CB_WIFI_LIST, plc_var.info.wifi_size, (byte *)&plc_var.info.wifi_list);
                break;
            case CB_WIFI_SET_PASS:
                int plen;
                plen = strlen((const char *)argv);
                kvdb.set("wifi_pass", (const char *)argv, plen);
                wifi_reload();
                fm->sendSysex(FirmataStream, CB_WIFI_SET_PASS, 0, argv);
                break;
#endif
#if defined(RTE_APP) || defined(PLC)
#ifndef PLC
        case FM_PUT_DATA_BLOCK:
            u32 crc, crc_r;
            byte *buffer_data;
            if (argc < 12)
                break;
            buffer_data = (byte *) malloc(argc);

            len_data = decodeByteStream(argc, argv, buffer_data);
            crc = GenerateCRC32Sum((const u8 *) buffer_data, len_data - 4, 0);
            crc_r = *(u32 *) (&buffer_data[len_data - 4]);
            if (crc_r != crc) {
                state = CRC_ERROR;
                logger.error("crc error block %d 0x%x 0x%x argc=%d len=%d", *(int *) &buffer_data[0], crc, crc_r, argc,
                             len_data);
            } else {
                rte.set_state(PLC_STATUS::APP_FLASH_BEGIN);
                int block = *(int *) &buffer_data[0];
                if (block == 0) {
                    // if (ifirmata.dev) {
                    //     state = DEV_IS_OPEN;
                    // } else
                    {
                        u32 object = *(u32 *) &buffer_data[4];

